[
  {
    "subname": "साधारण वर्तमान",
    "usage": [
      "आदतों या दोहराई जाने वाली क्रियाओं को व्यक्त करता है।",
      "तथ्यों या सामान्य सत्यों को दर्शाता है।",
      "समय-सारणी या कार्यक्रमों का वर्णन करता है।",
      "भावनाओं, विचारों या अवस्थाओं को व्यक्त करता है।"
    ]
  },
  {
    "subname": "वर्तमान निरंतर",
    "usage": [
      "वे क्रियाएँ जो बोलते समय हो रही हैं।",
      "भविष्य की योजनाओं या व्यवस्थाओं को व्यक्त करता है।",
      "अस्थायी क्रियाओं या स्थितियों का वर्णन करता है।",
      "बदलती या विकसित होती स्थितियों को व्यक्त करता है।"
    ]
  },
  {
    "subname": "पूर्ण वर्तमान",
    "usage": [
      "ऐसी क्रियाएँ जो अतीत में पूरी हुईं लेकिन वर्तमान से संबंधित हैं।",
      "अनुभवों या उपलब्धियों को व्यक्त करता है।",
      "ऐसी क्रियाएँ जो अतीत में शुरू हुईं और वर्तमान तक जारी हैं।",
      "ऐसी क्रियाएँ जो अतीत में कई बार हुई हैं।"
    ]
  },
  {
    "subname": "पूर्ण निरंतर वर्तमान",
    "usage": [
      "ऐसी क्रियाएँ जो अतीत में शुरू हुईं और वर्तमान तक जारी हैं।",
      "किसी क्रिया की अवधि या निरंतरता पर ज़ोर देता है।",
      "ऐसी क्रियाएँ जो हाल ही में समाप्त हुई हैं।"
    ]
  },
  {
    "subname": "साधारण भूतकाल",
    "usage": [
      "अतीत में पूरी हो चुकी क्रियाओं का वर्णन करता है।",
      "अतीत की आदतों या दिनचर्या को व्यक्त करता है।",
      "अतीत में पूरी हुई घटनाओं की श्रृंखला को दर्शाता है।"
    ]
  },
  {
    "subname": "भूतकाल निरंतर",
    "usage": [
      "किसी निश्चित समय पर अतीत में हो रही क्रियाओं को दर्शाता है।",
      "अतीत में एक साथ हो रही दो घटनाओं को व्यक्त करता है।",
      "अतीत में किसी क्रिया के बाधित होने को दर्शाता है।"
    ]
  },
  {
    "subname": "पूर्ण भूतकाल",
    "usage": [
      "अतीत में किसी अन्य क्रिया से पहले पूरी हुई क्रियाओं को दर्शाता है।",
      "अतीत में एक निश्चित समय से पहले पूरी हुई क्रियाओं को व्यक्त करता है।"
    ]
  },
  {
    "subname": "पूर्ण निरंतर भूतकाल",
    "usage": [
      "किसी अन्य क्रिया से पहले अतीत में जारी क्रियाओं का वर्णन करता है।",
      "अतीत में किसी निश्चित समय से पहले किसी क्रिया की अवधि को दर्शाता है।"
    ]
  },
  {
    "subname": "साधारण भविष्य",
    "usage": [
      "भविष्य में होने वाली क्रियाओं का वर्णन करता है।",
      "भविष्यवाणियों, वादों या त्वरित निर्णयों को व्यक्त करता है।"
    ]
  },
  {
    "subname": "भविष्य निरंतर",
    "usage": [
      "भविष्य में किसी निश्चित समय पर जारी क्रियाओं को दर्शाता है।",
      "भविष्य में किसी अवधि के दौरान होने वाली क्रियाओं को व्यक्त करता है।"
    ]
  },
  {
    "subname": "पूर्ण भविष्य",
    "usage": [
      "भविष्य में एक निश्चित समय से पहले पूरी होने वाली क्रियाओं का वर्णन करता है।",
      "भविष्य में किसी अन्य क्रिया से पहले पूरी होने वाली क्रियाओं को व्यक्त करता है।"
    ]
  },
  {
    "subname": "पूर्ण निरंतर भविष्य",
    "usage": [
      "भविष्य में किसी निश्चित समय तक जारी रहने वाली क्रियाओं को दर्शाता है।",
      "भविष्य में किसी क्रिया की अवधि पर ज़ोर देता है।"
    ]
  }
]
