[
  {
    "title": "The Last Day of School",
    "content": "It was the final day of ninth grade, and the classroom buzzed with excitement. \n\nMia sat by the window, doodling in her notebook, while the teacher, Mrs. Carter, tried to keep everyone focused on the last math lesson. \n\nThe chalkboard was covered with equations, but no one cared—summer was hours away. \n\nMia’s best friend, Sam, whispered about their plans: biking to the lake, eating ice cream, and forgetting about homework for two whole months. \n\nShe grinned, imagining the freedom. But then Mrs. Carter called her name. “Mia, solve this problem,” she said, pointing to a tricky algebra equation. \n\nThe room went silent, all eyes on her. Mia froze; she’d been too busy daydreaming to listen. \n\nSam nudged her and whispered, “X equals twelve.” \n\nMia scribbled the answer down, her heart pounding, and got it right. \n\nMrs. Carter nodded, unimpressed, and moved on. Relief washed over Mia, but she felt a pang of guilt—she’d coasted through the year, relying on Sam too much. \n\nAt recess, she pulled him aside near the swings. \n\n“I need to study harder next year,” she said. \n\nSam shrugged and replied, “We’ll do it together.” \n\nThat promise stuck with her. \n\nLater, the class gathered for yearbook signing. \n\nMia wrote in Sam’s, “Thanks for saving me—math and more.” \n\nHe laughed and scribbled back, “Teamwork makes the dream work.” \n\nThe bell rang, and they spilled outside, shouting and tossing papers in the air. \n\nMia looked back at the school, its red brick walls glowing in the sun. \n\nShe’d miss the chaos—the lunchroom chatter, the locker slams, even Mrs. Carter’s stern voice. \n\nOn the bike ride home, Sam raced ahead, yelling, “Summer starts now!” \n\nBut Mia pedaled slower, lost in thought about the coming fall. \n\nTenth grade meant tougher classes, maybe new friends, and definitely more responsibility. \n\nShe remembered the science fair disaster, when her volcano exploded too early and soaked everyone, and the time she aced a history test after cramming all night. \n\nSchool wasn’t just about grades—it was about the late-night talks with Sam, the silly bets over who’d finish their essay first, and the quiet pride of figuring things out. \n\nAt home, she flopped on her bed, yearbook in hand, flipping through memories. \n\nA photo of her and Sam at the spring dance made her smile; they had stepped on each other’s toes but laughed through it. \n\nShe realized that while ninth grade wasn’t perfect, it was hers. \n\nTomorrow, she’d dive into summer, but tonight she let the bittersweet ache of the last day linger, knowing she’d carry these moments forever.",
    "properly": [
      "Mia",
    "Mrs. Carter",
    "Sam",
    "ninth grade",
    "tenth grade",
    "the lake",
    "yearbook",
    "spring dance"
  ]
  }
]
  