[
  {
    "title": "The Last Day of School",
    "content": "It was the final day of ninth grade, and the classroom buzzed with excitement. \n\nMia sat by the window, doodling in her notebook, while the teacher, Mrs. Carter, tried to keep everyone focused on the last mathematics lesson. \n\nThe chalkboard was covered with equations, but no one cared—summer was hours away. \n\nMia’s best friend, Sam, whispered about their plans: biking to the lake, eating ice cream, and forgetting about homework for two whole months. \n\nShe grinned, imagining the freedom. But then Mrs. Carter called her name. “Mia, solve this problem,” she said, pointing to a tricky algebra equation. \n\nThe room went silent, all eyes on her. Mia froze; she had been too busy daydreaming to listen. \n\nSam nudged her and whispered, “X equals twelve.” \n\nMia scribbled the answer down, her heart pounding, and got it right. \n\nMrs. Carter nodded, unimpressed, and moved on. Relief washed over Mia, but she felt a pang of guilt—she had coasted through the year, relying on Sam too much. \n\nAt recess, she pulled him aside near the swings. \n\n“I need to study harder next year,” she said. \n\nSam shrugged and replied, “We will do it together.” \n\nThat promise stuck with her. \n\nLater, the class gathered for yearbook signing. \n\nMia wrote in Sam’s yearbook, “Thank you for saving me—mathematics and more.” \n\nHe laughed and scribbled back, “Teamwork makes the dream work.” \n\nThe bell rang, and they spilled outside, shouting and tossing papers in the air. \n\nMia looked back at the school, its red brick walls glowing in the sun. \n\nShe would miss the chaos—the lunchroom chatter, the locker slams, even Mrs. Carter’s stern voice. \n\nOn the bike ride home, Sam raced ahead, yelling, “Summer starts now!” \n\nBut Mia pedaled slower, lost in thought about the coming fall. \n\nTenth grade meant tougher classes, maybe new friends, and definitely more responsibility. \n\nShe remembered the science fair disaster, when her volcano exploded too early and soaked everyone, and the time she aced a history test after cramming all night. \n\nSchool was not just about grades—it was about the late-night talks with Sam, the silly bets over who would finish their essay first, and the quiet pride of figuring things out. \n\nAt home, she flopped on her bed, yearbook in hand, flipping through memories. \n\nA photograph of her and Sam at the spring dance made her smile; they had stepped on each other’s toes but laughed through it. \n\nShe realized that while ninth grade was not perfect, it was hers. \n\nTomorrow, she would dive into summer, but tonight she let the bittersweet ache of the last day linger, knowing she would carry these moments forever.. \n\n",
    "properly": [
      "Mia",
      "Mrs. Carter",
      "Sam",
      "ninth grade",
      "tenth grade",
      "the lake",
      "yearbook",
      "spring dance"
    ]
  },
  {
    "title": "A Memorable Train Journey",
    "content": "The train departed from the station in the early morning, with a thin mist still lingering over the small houses along the tracks. I sat by the window, holding a steaming cup of coffee, watching the scenery pass by. This journey had been long awaited—a trip through the majestic sea, forest, and mountains. \n\nThe train first followed the coastline. The sun gradually rose above the horizon, painting the ocean in golden hues. Waves gently lapped against the white sandy shore, and distant fishing boats drifted slowly on the shimmering water. A sea breeze rushed through the window, carrying the salty scent of the ocean, bringing a sense of tranquility. \n\nAs the train moved away from the coast, the scenery transformed. Endless green forests stretched to the horizon. Sunlight filtered through the dense canopy, creating glistening patterns on the forest floor. The calls of birds echoed through the trees, blending harmoniously with the rhythmic sound of the train wheels. Occasionally, the train passed by a small stream, its crystal-clear water reflecting the sunlight like sparkling gems. \n\nContinuing the journey, the train began to ascend winding mountain paths. From the window, I gazed down into deep valleys, where small villages nestled at the foot of towering peaks. Clouds floated lazily around the mountaintops, making the landscape resemble a traditional watercolor painting. An old iron bridge appeared ahead, connecting two grand mountains. As the train carefully crossed, my heart pounded at the sheer magnificence of nature. In the distance, a winding river snaked through the lush green hills, resembling a silky ribbon draped across the vast wilderness. \n\nMy travel companion, an elderly man with a wise demeanor, smiled and said, 'Every train journey tells a story, and these breathtaking views are the rewards for those who truly appreciate the experience.' I nodded, savoring every precious moment. \n\nAs the train neared its final station, I knew this journey would remain etched in my memory forever. The breathtaking landscapes of the sea, forest, and mountains had left an indelible mark on my mind, like a magnificent painting of nature that I was fortunate to witness. Taking a deep breath, I cherished the essence of the journey before stepping onto the platform with a satisfied smile.. \n\n",
    "properly": [
      "The train",
      "The ocean",
      "The coastline",
      "The sun"
    ]
  }
]