[
  {
    "title": "The Mysterious Clock",
    "content": "One evening, Ben found an old clock in his grandfather’s attic. It didn’t tick, but at midnight, it glowed and showed him a vision of the past—his grandfather as a young boy playing by the river. Ben watched in awe, learning family secrets he’d never known."
  },
  {
    "title": "The Enchanted Forest",
    "content": "Lucy wandered into a forest where the trees whispered her name. She followed the sound and found a glowing flower. When she touched it, she could hear animals talk. A deer told her the forest was alive and needed her help to stay safe from harm."
  },
  {
    "title": "The Clever Thief",
    "content": "A thief named Jack tried to steal a golden necklace from a museum. He didn’t know it was cursed. Every time he touched it, he turned into a mouse until he apologized. Jack returned it and vowed to never steal again, fearing the curse’s return."
  },
  {
    "title": "The Secret Island",
    "content": "While sailing, Mia spotted an island not on any map. She rowed ashore and found footprints leading to a cave. Inside was a diary from a lost explorer, detailing a life of adventure. Mia kept it secret, dreaming of her own journeys one day."
  },
  {
    "title": "The Singing Mountain",
    "content": "Tom climbed a mountain that hummed a strange tune. At the top, he found a crystal that sang when the wind blew. The villagers below thought it was magic, but Tom learned it was just the wind’s trick. Still, he loved the mystery of it all."
  },
  {
    "title": "The Invisible Friend",
    "content": "Ella felt lonely until she met an invisible boy named Finn. He’d knock on her window and leave gifts like flowers or notes. One day, Finn revealed he was a ghost who just wanted a friend. Ella smiled, happy to have him around forever."
  },
  {
    "title": "The Golden Fish",
    "content": "Sam caught a golden fish that begged for freedom. In exchange, it promised him three wishes. Sam wished for wisdom, health, and peace. The fish swam away, and Sam felt richer than ever, even without gold, knowing he’d chosen well for his life."
  },
  {
    "title": "The Haunted Library",
    "content": "In an old library, books floated off shelves at night. Lily stayed late to see why and met a ghost librarian who missed reading to kids. Lily offered to read aloud, and the ghost smiled, finally at peace with her new friend’s voice echoing."
  },
  {
    "title": "The Time Traveler’s Watch",
    "content": "Jake’s watch didn’t just tell time—it sent him back to 1900. He met a girl who looked like his sister and helped her fix a broken bridge. When he returned, he found her photo in an old book, proving time had connected them across years."
  },
  {
    "title": "The Star Painter",
    "content": "Every night, Clara painted stars on her ceiling, wishing they’d come alive. One night, they did, twinkling above her. A voice said, 'You made us real.' Clara kept painting, knowing her dreams could light up the world, one star at a time."
  }
]