[
  {
    "title": "The Last Day of School",
    "content": "It was the final day of ninth grade, and the classroom buzzed with excitement. Mia sat by the window, doodling in her notebook, while the teacher, Mrs. Carter, tried to keep everyone focused on the last math lesson. The chalkboard was covered with equations, but no one cared—summer was hours away. Mia’s best friend, Sam, whispered about their plans: biking to the lake, eating ice cream, and forgetting homework for two whole months. She grinned, imagining the freedom. But then Mrs. Carter called her name. 'Mia, solve this problem,' she said, pointing to a tricky algebra equation. The room went silent, all eyes on her. Mia froze. She’d been too busy dreaming to listen. Sam nudged her, whispering, 'X equals twelve.' She scribbled it down, heart pounding, and got it right. Mrs. Carter nodded, unimpressed, and moved on. Relief washed over Mia, but she felt a pang of guilt—she’d coasted through the year, relying on Sam too much. At recess, she pulled him aside near the swings. 'I need to study harder next year,' she said. Sam shrugged. 'We’ll do it together.' That promise stuck with her. Later, the class gathered for yearbook signing. Mia wrote in Sam’s, 'Thanks for saving me—math and more.' He laughed, scribbling back, 'Teamwork makes the dream work.' The bell rang, and they spilled outside, shouting and tossing papers in the air. Mia looked back at the school, its red brick walls glowing in the sun. She’d miss the chaos—the lunchroom chatter, the locker slams, even Mrs. Carter’s stern voice. On the bike ride home, Sam raced ahead, yelling, 'Summer starts now!' But Mia pedaled slower, thinking about the fall. Tenth grade meant tougher classes, maybe new friends, and definitely more responsibility. She remembered the science fair disaster when her volcano exploded too early, soaking everyone, and the time she aced a history test after cramming all night. School wasn’t just about grades—it was the late-night talks with Sam, the silly bets over who’d finish their essay first, and the quiet pride of figuring things out. At home, she flopped on her bed, yearbook in hand, flipping through memories. A photo of her and Sam at the spring dance made her smile—they’d stepped on each other’s toes but laughed through it. She realized ninth grade wasn’t perfect, but it was hers. Tomorrow, she’d dive into summer, but tonight, she let the bittersweet ache of the last day linger, knowing she’d carry these moments forever.",
    "properly": [
      "Mia",
    "Mrs. Carter",
    "Sam",
    "ninth grade",
    "tenth grade",
    "the lake",
    "yearbook",
    "spring dance"
  ]
  }
]
  