[
  {
    "subname": "ปัจจุบันอย่างง่าย",
    "usage": [
      "แสดงนิสัยหรือการกระทำที่เกิดซ้ำ",
      "ระบุข้อเท็จจริงหรือความจริงทั่วไป",
      "อธิบายตารางเวลาหรือกำหนดการ",
      "แสดงความรู้สึก ความคิด หรือสภาวะ"
    ]
  },
  {
    "subname": "ปัจจุบันต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่กำลังเกิดขึ้นในขณะพูด",
      "แสดงแผนการหรือข้อตกลงในอนาคต",
      "อธิบายการกระทำหรือสถานการณ์ชั่วคราว",
      "แสดงการเปลี่ยนแปลงหรือการพัฒนา"
    ]
  },
  {
    "subname": "ปัจจุบันสมบูรณ์",
    "usage": [
      "อธิบายการกระทำที่เสร็จสิ้นในอดีตแต่ยังเกี่ยวข้องกับปัจจุบัน",
      "แสดงประสบการณ์หรือความสำเร็จ",
      "อธิบายการกระทำที่เริ่มในอดีตและดำเนินต่อถึงปัจจุบัน",
      "อธิบายการกระทำที่เกิดขึ้นหลายครั้งในอดีต"
    ]
  },
  {
    "subname": "ปัจจุบันสมบูรณ์ต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่เริ่มในอดีตและดำเนินต่อถึงปัจจุบัน",
      "เน้นระยะเวลาหรือความต่อเนื่องของการกระทำ",
      "อธิบายการกระทำที่เพิ่งสิ้นสุดลง"
    ]
  },
  {
    "subname": "อดีตอย่างง่าย",
    "usage": [
      "อธิบายการกระทำที่เสร็จสิ้นในอดีต",
      "แสดงนิสัยหรือกิจวัตรในอดีต",
      "อธิบายลำดับเหตุการณ์ที่เกิดขึ้นในอดีต"
    ]
  },
  {
    "subname": "อดีตต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่กำลังดำเนินอยู่ในช่วงเวลาหนึ่งในอดีต",
      "แสดงสองเหตุการณ์ที่เกิดขึ้นพร้อมกันในอดีต",
      "อธิบายการกระทำที่ถูกขัดจังหวะในอดีต"
    ]
  },
  {
    "subname": "อดีตสมบูรณ์",
    "usage": [
      "อธิบายการกระทำที่เสร็จก่อนเหตุการณ์อื่นในอดีต",
      "แสดงการกระทำที่เสร็จสิ้นก่อนช่วงเวลาหนึ่งในอดีต"
    ]
  },
  {
    "subname": "อดีตสมบูรณ์ต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่ดำเนินมาก่อนเหตุการณ์อื่นในอดีต",
      "เน้นระยะเวลาของการกระทำก่อนช่วงเวลาหนึ่งในอดีต"
    ]
  },
  {
    "subname": "อนาคตอย่างง่าย",
    "usage": [
      "อธิบายการกระทำที่จะเกิดขึ้นในอนาคต",
      "แสดงการคาดการณ์ คำสัญญา หรือการตัดสินใจทันที"
    ]
  },
  {
    "subname": "อนาคตต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่จะดำเนินอยู่ในช่วงเวลาหนึ่งในอนาคต",
      "แสดงการกระทำที่จะเกิดขึ้นในช่วงระยะเวลาหนึ่งในอนาคต"
    ]
  },
  {
    "subname": "อนาคตสมบูรณ์",
    "usage": [
      "อธิบายการกระทำที่จะเสร็จสิ้นก่อนเวลาหนึ่งในอนาคต",
      "แสดงการกระทำที่จะเสร็จสิ้นก่อนเหตุการณ์อื่นในอนาคต"
    ]
  },
  {
    "subname": "อนาคตสมบูรณ์ต่อเนื่อง",
    "usage": [
      "อธิบายการกระทำที่ดำเนินอยู่จนถึงช่วงเวลาหนึ่งในอนาคต",
      "เน้นระยะเวลาของการกระทำจนถึงจุดหนึ่งในอนาคต"
    ]
  }
]
