[
  {
    "subname": "سادہ حال",
    "usage": [
      "عادات یا دہرائی جانے والی کارروائیوں کا اظہار کرتا ہے۔",
      "حقائق یا عمومی سچائیوں کو بیان کرتا ہے۔",
      "شیڈول یا ٹائم ٹیبلز کی وضاحت کرتا ہے۔",
      "جذبات، خیالات، یا حالتوں کا اظہار کرتا ہے۔"
    ]
  },
  {
    "subname": "موجودہ جاری",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو بولنے کے وقت ہو رہی ہوتی ہیں۔",
      "مستقبل کے منصوبوں یا انتظامات کا اظہار کرتا ہے۔",
      "عارضی کارروائیوں یا حالات کی وضاحت کرتا ہے۔",
      "بدلتے یا ترقی پذیر حالات کا اظہار کرتا ہے۔"
    ]
  },
  {
    "subname": "موجودہ مکمل",
    "usage": [
      "ایسی کارروائیاں جو ماضی میں مکمل ہو چکی ہیں لیکن حال سے متعلق ہیں۔",
      "تجربات یا کامیابیوں کا اظہار کرتا ہے۔",
      "ایسی کارروائیاں جو ماضی میں شروع ہوئیں اور حال تک جاری ہیں۔",
      "ایسی کارروائیاں جو ماضی میں کئی بار ہو چکی ہیں۔"
    ]
  },
  {
    "subname": "موجودہ مکمل جاری",
    "usage": [
      "ایسی کارروائیاں جو ماضی میں شروع ہوئیں اور اب تک جاری ہیں۔",
      "کسی کارروائی کے دورانیے یا تسلسل پر زور دیتا ہے۔",
      "ایسی کارروائیاں جو حال ہی میں ختم ہوئی ہیں۔"
    ]
  },
  {
    "subname": "سادہ ماضی",
    "usage": [
      "ماضی میں مکمل کی گئی کارروائیوں کو بیان کرتا ہے۔",
      "ماضی کی عادات یا معمولات کا اظہار کرتا ہے۔",
      "ماضی میں مکمل ہونے والی کارروائیوں کے سلسلے کو بیان کرتا ہے۔"
    ]
  },
  {
    "subname": "ماضی جاری",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو ماضی میں کسی مخصوص وقت پر جاری تھیں۔",
      "ایسی دو کارروائیاں بیان کرتا ہے جو ماضی میں ایک ساتھ ہو رہی تھیں۔",
      "ایسی کارروائی کو بیان کرتا ہے جو ماضی میں کسی اور کارروائی سے رُک گئی ہو۔"
    ]
  },
  {
    "subname": "ماضی مکمل",
    "usage": [
      "ایسی کارروائیاں جو ماضی میں کسی اور کارروائی سے پہلے مکمل ہو چکی تھیں۔",
      "ماضی میں کسی خاص وقت سے پہلے مکمل کی گئی کارروائیوں کا اظہار کرتا ہے۔"
    ]
  },
  {
    "subname": "ماضی مکمل جاری",
    "usage": [
      "ایسی کارروائیاں جو کسی اور کارروائی سے پہلے ماضی میں جاری تھیں۔",
      "کسی کارروائی کے ماضی میں ایک خاص وقت تک جاری رہنے کے دورانیے پر زور دیتا ہے۔"
    ]
  },
  {
    "subname": "سادہ مستقبل",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو مستقبل میں ہوں گی۔",
      "پیش گوئیوں، وعدوں، یا فوری فیصلوں کا اظہار کرتا ہے۔"
    ]
  },
  {
    "subname": "مستقبل جاری",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو مستقبل میں کسی مخصوص وقت پر جاری ہوں گی۔",
      "ایسی کارروائیاں جو مستقبل میں کسی مدت کے دوران جاری رہیں گی۔"
    ]
  },
  {
    "subname": "مستقبل مکمل",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو مستقبل میں کسی مخصوص وقت سے پہلے مکمل ہو چکی ہوں گی۔",
      "ایسی کارروائیاں جو مستقبل میں کسی اور کارروائی سے پہلے مکمل ہوں گی۔"
    ]
  },
  {
    "subname": "مستقبل مکمل جاری",
    "usage": [
      "ایسی کارروائیاں بیان کرتا ہے جو مستقبل میں کسی خاص وقت تک جاری رہیں گی۔",
      "کسی کارروائی کے مستقبل میں ایک خاص وقت تک جاری رہنے کے دورانیے پر زور دیتا ہے۔"
    ]
  }
]
